# EditScope Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EditScope Properties
EditScope Class See Also
---
The EditScope type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsActive | Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet. |
| IsPermitted | Tells if the edit scope is permitted to start. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
EditScope Class
Autodesk.Revit.DB Namespace